// ===== (1)Выведите в консоль все целые числа от 1 до 100.===== \\
let i = 1;
for (let i = 1; i <= 100; i++) {
  console.log(i);
}
// ===== (2)Выведите в консоль все целые числа от -100 до 0.===== \\
let a = -100;
for (let i = -100; i <= 0; i++) {
  console.log(i);
}

// ===== (3)Выведите в консоль все целые числа от 100 до 1.===== \\
let b = 100;
for (let i = 100; i >= 1; i--) {
  console.log(i);
}

// ===== (4)Выведите в консоль все четные числа из промежутка от 1 до 100.===== \\
let c = 100;
for (let i = 100; i >= 1; i--) {
  if(i % 2 ==0){
    console.log(i);
  }
}

// ===== (5)Выведите в консоль все числа кратные трем в промежутке от 1 до 100.===== \\
let d = 100;
for (let i = 100; i >= 1; i--) {
  if(i % 3 ==0){
    console.log(i);
  }
}