// =====  (1)Дана строка:   ===== \\
// ____________'abcde'_____________\\
// Получите массив букв этой строки.\\
let arr = 'abcd';
let x = arr.split('');
console.log(x);


//====(2)Дано некоторое число:====\\
// _____________12345______________\\
// Получите массив цифр этого числа.\\
let a1 = String(123456789);
let b1 = a1.split('').join();
console.log(b1);


//====(3)Дано некоторое число:====\\
// _____________12345_____________\\
// ________Переверните его________\\
// _____________54321_____________\\
let a = 123456789;
let b = a.toString().split('').reverse().join();
console.log(b);

// = (4)Дано некоторое число = \\
// ____________12345____________\\
// Найдите сумму цифр этого числа.\\
let n = 12345;
let sum = 0;
while (n > 0) {
    sum += n % 10
    n = Math.floor(n/10)
}
console.log(sum);